"""
Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление.
Функцию hex используйте для проверки своего результата.
"""

num = int(input('your num: '))
print(f"{num}(10) = {hex(num)}(16)")